hiperiondev/esp32idf_APRS/main/aprs_service.c
// @file aprs_service.c
//
// @author Emiliano Augusto Gonzalez ( lu3vea @ gmail . com)
// @date 2026
// @copyright GNU General Public License v3
// @see https://github.com/hiperiondev/esp32idf_APRS
//
// @note
// This is based on other projects:
//     VP-Digi: https://github.com/sq8vps/vp-digi
//     ESP32APRS: https://github.com/nakhonthai/ESP32APRS_Audio
//     LibAPRS: https://github.com/markqvist/LibAPRS
//
//     please contact their authors for more information.
//
// @brief APRS application layer: maps g_config onto the modem configuration,
// installs the modem RX callback that feeds the digipeater, IGate, message,
// lastheard and trafficlog components, provides the TNC2 transmit path and runs
// the periodic service tick.

#include <stdatomic.h>
#include <stdio.h>
#include <string.h>
#include <strings.h>

#include "esp_log.h"
#include "esp_random.h"
#include "esp_timer.h"
#include "freertos/FreeRTOS.h"
#include "freertos/semphr.h"
#include "freertos/task.h"

#include "afsk.h"
#include "ax25.h"
#include "esp32idf_radioamateur_modem.h"
#include "esp32idf_radioamateur_modem_config.h"
#include "modem.h"

#include "app_config.h"
#include "aprs_coord.h"
#include "aprs_filter.h"
#include "aprs_path.h"
#include "aprs_service.h"
#include "beacon.h"
#include "beacon_scheduler.h"
#include "bulletins.h"
#include "digirepeater.h"
#include "igate.h"
#include "lastheard.h"
#include "message.h"
#include "objects_items.h"
#include "query.h"
#include "str_append.h"
#include "telemetry.h"
#include "time_sync.h"
#include "trafficlog.h"
#include "weather.h"

static const char *TAG = "aprs_service";

// Destination call this station's own INET->RF third-party frames key up
// under, matching the destination every other own-originated packet type
// (beacon, weather, telemetry, bulletins, objects/items) uses.
#define IGATE_THIRDPARTY_DEST "APE32L"

// How many frames aprs_service_send_tnc2() lets pile up in the RF TX ring
// before it starts discarding new packets instead of queuing them (see the
// comment inside that function).
//
// This is g_config.rf_tx_buffers, web-configurable on the Radiomodem page's
// Audio/AFSK section as "TX buffers", and persisted to /storage/config.json.
// aprs_service_send_tnc2() reads g_config.rf_tx_buffers directly on every
// call, so a Save on that page takes effect immediately, on the very next
// transmit, without a reboot. RF_TX_BUFFERS_MIN/MAX (aprs_service.h) bound
// both the web form (page_radio.c) and the value loaded from flash
// (app_config.c) - see aprs_service.h for why they're tied to
// AX25_TX_FRAME_RING_MAX rather than an independently-chosen number.

// When the beacon scheduler hands off a frame and the RF TX ring is momentarily
// full with a previous beacon from the SAME synchronous pass (the common case
// with the default TX buffers = 1, when e.g. tracker/WX/telemetry come due
// together), wait up to this long for the ring to drain below the limit rather
// than dropping. A single 1200 Bd frame plus TXDelay/slot time is well under a
// second, so this budget comfortably covers one in-flight frame clearing the
// air; the cap only exists so a wedged modem (ring never draining) can't hang
// the scheduler task indefinitely. Only the beacon scheduler context waits
// (see aprs_service_set_beacon_context()); every other caller drops rather than waits.
#define RF_TX_DRAIN_WAIT_MS 4000
#define RF_TX_DRAIN_POLL_MS 20

// ---------------------------------------------------------------------------
// Long-term TX duty-cycle limiter
//
// The CSMA/p-persistent gear above (tx_timeslot, csma_persist) and the RF TX
// ring backlog cap (rf_tx_buffers) only ever look at the instant a frame is
// offered for transmission: whether the channel is clear right now, and
// whether the ring has room right now. Neither one bounds how much of a
// rolling window this station itself spends transmitting - a scheduler pass
// in which several independently-scheduled periodic reports (beacon,
// objects/items, weather, telemetry, bulletins) fall due together clears
// CSMA individually, one after another, with no ceiling on the cumulative
// airtime that run adds up to.
// This accumulator gives that ceiling, tracked independently of channel
// contention, as standard practice (and in several band plans a hard
// regulatory requirement) for an unattended/automatic station.
//
// The window is a fixed-size ring of DUTY_CYCLE_BUCKET_COUNT buckets, each
// covering DUTY_CYCLE_BUCKET_MS of wall-clock time and holding the
// milliseconds of estimated airtime transmitted during it. Advancing the
// window (duty_cycle_advance_locked()) zeroes every bucket the clock has
// moved past since the last touch, so the sum of all buckets is always the
// airtime transmitted within the last DUTY_CYCLE_WINDOW_MS, no separate
// timer or task required to age entries out.
#define DUTY_CYCLE_WINDOW_MS    (10U * 60U * 1000U)                           // rolling window the ceiling is measured over: 10 minutes
#define DUTY_CYCLE_BUCKET_MS    (15U * 1000U)                                 // width of one accumulator bucket
#define DUTY_CYCLE_BUCKET_COUNT (DUTY_CYCLE_WINDOW_MS / DUTY_CYCLE_BUCKET_MS) // number of buckets the ring holds (40 at the defaults above)

// Fixed per-frame overhead, in bytes, folded into estimate_tx_airtime_ms()'s
// airtime estimate on top of the TNC2 text length: the opening/closing HDLC
// flag bytes and the 2-byte FCS that the encoded AX.25 frame carries and the
// TNC2 text does not.
#define DUTY_CYCLE_FRAME_OVERHEAD_BYTES 8

// Worst-case HDLC bit-stuffing allowance, percent, added to the raw bit count
// in estimate_tx_airtime_ms(): one stuffed bit is inserted per five
// consecutive 1 bits, so this over-estimates rather than under-estimates the
// airtime a frame actually spends on the air.
#define DUTY_CYCLE_BITSTUFF_PCT 20

// Size of the buffer aprs_msg_callback() renders a received frame into. See
// the derivation of the 365-character worst case there; rounded up to 384 to
// leave the render immune to a future change in how a callsign is printed,
// while staying well inside the modem service task's stack.
#define APRS_RX_TNC2_BUF_SIZE 384

// ---------------------------------------------------------------------------
// Modem configuration
//
// Single mapping point from g_config to the component's modem_config_t, used
// by main.c at boot, by page_radio.c's Save (live re-apply, no reboot) and by
// the LOOP TEST below (which only overrides full_duplex).
//
// What the modem component does NOT take at runtime, and where each setting
// lives instead:
//   audio pins        -> compile-time MODEM_ADC_GPIO / MODEM_DAC_GPIO, set in
//                        the top-level CMakeLists.txt. Changing the audio
//                        front-end pins requires a rebuild.
//   ADC attenuation   -> compile-time MODEM_ADC_ATTEN (ADC_ATTEN_DB_12).
//   hardware squelch  -> none. The component gates RX on the demodulator's own
//                        DCD rather than on a squelch line, and it has no RF
//                        power-switch output either.
//   software squelch,
//   RX volume, AGC
//   gain ceiling      -> none. The component's AGC is self-limiting and there
//                        is no RX gain trim.
//
// PTT's active level (MODEM_PTT_ACTIVE_HIGH) is mapped at runtime (below)
// straight from the compile-time macro, exactly like the PTT GPIO itself
// (MODEM_PTT_GPIO): both are fixed, compile-time-only board wiring choices -
// internal radiomodem features, exactly like MODEM_ADC_GPIO / MODEM_DAC_GPIO
// - and neither is stored in g_config nor exposed on the Radiomodem web
// page. The CMakeLists.txt board definition is the single source of truth
// for the PTT polarity.
// ---------------------------------------------------------------------------
void aprs_service_build_modem_config(modem_config_t *cfg, bool full_duplex) {
    modem_config_t base = MODEM_DEFAULT_CONFIG();
    *cfg = base;

