hiperiondev/esp32idf_APRS/main/aprs_service.c
    // Source callsign (with SSID), used both for the LAST HEARD table and
    // as the DX field of the traffic-table entry below.
    char callsign[12];
    if (msg->src.ssid > 0)
        snprintf(callsign, sizeof(callsign), "%s-%d", msg->src.call, msg->src.ssid);
    else
        snprintf(callsign, sizeof(callsign), "%s", msg->src.call);

    // Position/object/item reports start their info field with one of
    // !=/@; the symbol table and symbol code follow the latitude/longitude
    // fields. Handles both no-timestamp ('!'/'=') and timestamped ('/'/'@')
    // position formats - see aprs_extract_symbol() for the offset math.
    char symTable = 0, symCode = 0;
    aprs_extract_symbol((const char *)msg->info, msg->len, &symTable, &symCode);

    // Log every decoded RF frame so the web traffic viewer mirrors what the
    // serial console shows for RF activity, regardless of which
    // feature(s) below end up acting on it. AUDIO is the demodulated
    // signal level (mV RMS) reported by the AFSK/GFSK modem for this frame.
    ESP_LOGI(TAG, "RX: %s", tnc2);
    trafficlog_add_pkt("RX", callsign, tnc2, (int)msg->mVrms, symTable, symCode);

    // Feed the web dashboard's "LAST HEARD" table (see components/lastheard).
    {
        // str_append() clamps the running offset itself, so the loop needs no
        // per-iteration room check of its own to stay inside path[]: a frame
        // carrying the AX.25 maximum of 8 repeaters fills the buffer and any
        // remaining entries are simply left out of the display string. This is
        // a LAST HEARD label, so losing the tail of a long path is cosmetic.
        char path[48] = "";
        size_t plen = 0;
        // "Direct" means no digipeater actually relayed this frame. A path
        // entry only counts once its AX.25 "has been repeated" H-bit is set
        // (AX25_REPEATED); an unused WIDEn-N still in the path is a request
        // for a repeat that has not happened yet, so a frame carrying one is
        // still direct from this receiver's point of view. This is what the
        // "?APRSD" query reports, so it has to mean heard-off-the-air rather
        // than merely path-looks-empty.
        bool direct = true;
        for (int i = 0; i < msg->rpt_count; i++) {
            str_append(path, sizeof(path), &plen, "%s%s", (i == 0) ? "" : ",", msg->rpt_list[i].call);
            if (msg->rpt_list[i].ssid > 0)
                str_append(path, sizeof(path), &plen, "-%d", msg->rpt_list[i].ssid);
            if (AX25_REPEATED(msg, i))
                direct = false;
        }

        lastheard_add(callsign, path, true, direct, symTable, symCode);
    }

    // Placeholder/invalid source callsign check (NOCALL = radio not
    // configured, MYCALL = misconfigured/uninitialized digipeater config
    // sentinel used elsewhere in this codebase). This mirrors the same
    // check digiProcess() does internally, but runs unconditionally here so
    // it (and the dashboard's DROP counter) means something even with
    // digi_en off. A frame from either sentinel is never useful to
    // digipeat, gate, or otherwise act on, so skip the rest of the
    // dispatch chain for it.
    if (!strncmp(msg->src.call, "NOCALL", 6) || !strncmp(msg->src.call, "MYCALL", 6)) {
        atomic_fetch_add_explicit(&s_statDrop, 1, memory_order_relaxed);
        igate_note_drop(DROP_PLACEHOLDER_CALL);
        ESP_LOGD(TAG, "RX dropped, placeholder source callsign: %s", tnc2);
        return;
    }

    if (g_config.digi_en) {
        int action = digiProcess(msg);
        if (action == 2) {
            // Path was rewritten in place; re-transmit the modified frame on RF.
            int len = ax25ToTnc2(msg, tnc2, sizeof(tnc2));
            if (send_tnc2_impl(tnc2, (size_t)len, true)) {
                atomic_fetch_add_explicit(&s_statDigi, 1, memory_order_relaxed);
                ESP_LOGD(TAG, "DIGI TX: %s", tnc2);
                trafficlog_add_pkt("DIGI", callsign, tnc2, -1, symTable, symCode);
            }
        }
    }

    if (g_config.igate_en && g_config.rf2inet) {
        if (igateProcess(msg)) // builds its own qAR/qAO header and sends to APRS-IS internally
            atomic_fetch_add_explicit(&s_statRf2Inet, 1, memory_order_relaxed);
    }

    // handleIncomingAPRS() is the single ":ADDRESSEE:" parser for both APRS
    // messages and directed queries ("CALL:?query?") - see the split inside
    // it - so it must run whenever either feature is enabled, not just
    // msg_enable, or a directed query would never reach query_process_directed()
    // while messaging is turned off.
    if (g_config.msg_enable || (g_config.query_en && g_config.query_directed_en)) {
        ax25ToTnc2(msg, tnc2, sizeof(tnc2));
        handleIncomingAPRS(tnc2, QUERY_SRC_RF);
    }

    if (g_config.query_en) {
        ax25ToTnc2(msg, tnc2, sizeof(tnc2));
        query_process(tnc2, QUERY_SRC_RF);
    }
}

// ---------------------------------------------------------------------------
// Component RX callback.
//
// The modem component hands back the raw AX.25 bytes and leaves the decode to
// us, so this does the ax25_decode() itself, then dispatches to the handlers.
//
// Runs on the component's "modem_svc" task, whose stack the component sizes at
// 6144 bytes - enough for the ax25_msg_t below (~700 B) plus the rest of the
// dispatch chain, but worth remembering before adding anything large here.
//
// s_rxHook is the indirection the LOOP TEST uses to divert received frames to
// itself. It is owned here, not in the modem: the component's callback stays
// installed for the life of the process and only this pointer moves, so the
// diversion cannot disturb the component's own state.
// ---------------------------------------------------------------------------
typedef void (*aprs_rx_hook_t)(ax25_msg_t *msg);
static volatile aprs_rx_hook_t s_rxHook = aprs_msg_callback;

static void on_rx_frame(const modem_rx_frame_t *f, void *ctx) {
    (void)ctx;
    ax25_msg_t msg;

