hiperiondev/esp32idf_APRS/main/aprs_service.c
    atomic_fetch_add_explicit(&s_statRadioRx, 1, memory_order_relaxed);

    memset(&msg, 0, sizeof(msg));
    enum Ax25DecodeReason reason;
    if (!ax25_decode((uint8_t *)f->frame, f->len, f->mVrms, &msg, &reason)) {
        // Not a decodable APRS (UI, no-layer-3) frame: msg.info/len were
        // never populated, so there is nothing safe to dispatch; just count
        // it and stop here. This is tracked here unconditionally, regardless
        // of digi_en/igate_en, unlike the digi/igate-only drop/error
        // counters below it in the dashboard.
        //
        // ax25_decode()'s reason splits this into a malformed/corrupted
        // reception (ERR_AX25_DECODE) versus a well-formed frame that is
        // simply not APRS (ERR_AX25_NOT_APRS) - legacy connected-mode AX.25
        // traffic or a non-APRS PID sharing the channel, both expected and
        // benign on a shared frequency. Keeping the two counters and log
        // lines separate lets an operator tell "channel has non-APRS
        // traffic on it" apart from "my decoder is broken" from the
        // dashboard alone.
        atomic_fetch_add_explicit(&s_statErr, 1, memory_order_relaxed);
        if (reason == AX25_DECODE_NOT_UI || reason == AX25_DECODE_NOT_NOLAYER3) {
            igate_note_drop(ERR_AX25_NOT_APRS);
            ESP_LOGD(TAG, "RX non-APRS AX.25 frame (%s), %u bytes, %u mVrms", reason == AX25_DECODE_NOT_UI ? "not UI" : "not no-layer-3 PID", (unsigned)f->len,
                     (unsigned)f->mVrms);
        } else {
            igate_note_drop(ERR_AX25_DECODE);
            ESP_LOGD(TAG, "RX decode error (malformed frame), %u bytes, %u mVrms", (unsigned)f->len, (unsigned)f->mVrms);
        }
        return;
    }

    aprs_rx_hook_t hook = s_rxHook;
    if (hook)
        hook(&msg);
}

// Case-insensitive compare of a TNC2 source base callsign (SSID already
// stripped, given as ptr+len) against one configured own-station call. An
// empty configured call never matches, so report callsigns the operator left
// blank can't accidentally swallow foreign traffic.
static bool base_call_equals(const char *src, size_t srcLen, const char *cfg) {
    if (!cfg || cfg[0] == 0)
        return false;
    if (strlen(cfg) != srcLen)
        return false;
    for (size_t i = 0; i < srcLen; i++) {
        char a = src[i], b = cfg[i];
        if (a >= 'a' && a <= 'z')
            a -= 32;
        if (b >= 'a' && b <= 'z')
            b -= 32;
        if (a != b)
            return false;
    }
    return true;
}

// True if this APRS-IS line's SOURCE callsign (base call, SSID ignored) is one
// of THIS station's own report callsigns. Every report we upload to APRS-IS via
// its *_2inet flag is echoed straight back to us by the server; this lets
// inet2rfHandler() recognise those echoes so it never re-gates our own reports
// from INET back to RF. Our reports reach RF exclusively through their own
// "Send via RF" (*_2rf) flags in weather.c / beacon.c - the IGATE INET->RF
// filter is for foreign internet traffic only, never our own.
static bool inet_line_is_own_report(const char *line) {
    // Source call is everything up to the first '-' (SSID) or '>' (path).
    size_t srcLen = 0;
    while (line[srcLen] && line[srcLen] != '-' && line[srcLen] != '>')
        srcLen++;
    if (srcLen == 0)
        return false;

    // Every callsign any local report can transmit under. Blank entries are
    // skipped inside base_call_equals(), and reports that fall back to
    // aprs_mycall are covered by that entry.
    //
    // Telemetry's callsign persists to its own /storage/telemetry.json (see
    // telemetry.h), so it is fetched through telemetry_get_mycall() rather
    // than a direct g_config field.
    char tlm_mycall[10];
    telemetry_get_mycall(tlm_mycall, sizeof(tlm_mycall));

    // CROSS-REFERENCE: this array must be kept in sync with every *_mycall /
    // *_callsign field that can appear as the SOURCE of a report we send with
    // its matching *_2inet flag on (beacon.c, weather.c, telemetry.c,
    // trk_*.c, digi.c, message handling). Any new report source that gains
    // its own callsign field - or its own INET-upload flag - must be added
    // here too. An omitted callsign means the APRS-IS echo of our own report is
    // not recognised as such, and inet2rfHandler() re-gates it back to RF,
    // causing a feedback loop / double transmission. grep for "_2inet" across the tree
    // to find every current uplink flag this list needs to cover.
    const char *calls[] = {
        g_config.aprs_mycall, g_config.my_callsign, g_config.trk_mycall, g_config.digi_mycall, g_config.wx_mycall, tlm_mycall, g_config.msg_mycall,
    };
    for (size_t i = 0; i < sizeof(calls) / sizeof(calls[0]); i++) {
        if (base_call_equals(line, srcLen, calls[i]))
            return true;
    }
    return false;
}

// ---------------------------------------------------------------------------
// INET -> RF message gating.
//
// An IGate sits on a very large data stream and must not put messages on the
// air indiscriminately. A message read from APRS-IS is transmitted only when
// all four of the conditions the APRS-IS IGate design notes lay down hold at
// once: the addressee was heard on the local RF channel inside the configured
// window, the sender was NOT heard on RF inside that window, the sender's
// header carries none of TCPXX / NOGATE / RFONLY, and the addressee is not
// itself Internet-connected. Each failure has its own drop reason so the
// dashboard's Drop Breakdown says which condition stopped a message, which is
// the question an operator actually asks.
//
// Alongside that runs the associated-position rule: rather than replaying a
// station's historical position reports, the gateway notes the stations it has
// gated a message TO and forwards the next position report it sees for each of
// them, so the local operator has something to plot for the far end of the
// conversation.
//
// The ring below is touched only from inet2rfHandler(), which runs on the
// single igate task, so it needs no lock of its own.
// ---------------------------------------------------------------------------

