hiperiondev/esp32idf_APRS/main/aprs_service.c
static char s_msgAssoc[IGATE_MSG_ASSOC_MAX][12];

// Note one addressee as awaiting its position follow-up. A callsign already
// waiting keeps its slot instead of taking a second one; otherwise the oldest
// entry is overwritten, which at this ring size means the follow-up is offered
// for the most recent conversations and quietly forgotten for older ones.
static void msgAssocRemember(const char *call) {
    if (call == NULL || call[0] == 0)
        return;

    for (int i = 0; i < IGATE_MSG_ASSOC_MAX; i++) {
        if (strcasecmp(s_msgAssoc[i], call) == 0)
            return;
    }
    for (int i = 0; i < IGATE_MSG_ASSOC_MAX; i++) {
        if (s_msgAssoc[i][0] == 0) {
            strncpy(s_msgAssoc[i], call, sizeof(s_msgAssoc[i]) - 1);
            s_msgAssoc[i][sizeof(s_msgAssoc[i]) - 1] = 0;
            return;
        }
    }

    memmove(&s_msgAssoc[0], &s_msgAssoc[1], (IGATE_MSG_ASSOC_MAX - 1) * sizeof(s_msgAssoc[0]));
    strncpy(s_msgAssoc[IGATE_MSG_ASSOC_MAX - 1], call, sizeof(s_msgAssoc[0]) - 1);
    s_msgAssoc[IGATE_MSG_ASSOC_MAX - 1][sizeof(s_msgAssoc[0]) - 1] = 0;
}

// Claim the position follow-up owed to one station, if any. The slot is
// released by the claim, so exactly one position report is ever gated per
// message sent - what makes this a follow-up rather than a subscription.
static bool msgAssocTake(const char *call) {
    if (call == NULL || call[0] == 0)
        return false;

    for (int i = 0; i < IGATE_MSG_ASSOC_MAX; i++) {
        if (strcasecmp(s_msgAssoc[i], call) != 0)
            continue;
        memmove(&s_msgAssoc[i], &s_msgAssoc[i + 1], (size_t)(IGATE_MSG_ASSOC_MAX - 1 - i) * sizeof(s_msgAssoc[0]));
        s_msgAssoc[IGATE_MSG_ASSOC_MAX - 1][0] = 0;
        return true;
    }
    return false;
}

// Copy the addressee out of an APRS message payload. The information field is
// ":ADDRESSEE:text" with the addressee fixed at nine characters, space-padded
// on the right, so the second ':' always sits at info[10]; the padding is
// stripped here so the callsign matches the last-heard table's own key.
// Returns false for anything that is not shaped like a message.
static bool messageAddressee(const char *info, char *out, size_t outMax) {
    if (info == NULL || out == NULL || outMax < 10)
        return false;
    if (info[0] != ':' || strlen(info) < 11 || info[10] != ':')
        return false;

    size_t n = 9;
    while (n > 0 && info[n] == ' ')
        n--;
    memcpy(out, info + 1, n);
    out[n] = 0;
    return n > 0;
}

// True if the address block of a TNC2 line carries a token that forbids the
// packet reaching RF. Only the header is searched - everything up to the first
// ':' - so a message whose TEXT happens to mention one of these words is not
// mistaken for one routed with it.
static bool headerForbidsRf(const char *line) {
    const char *colon = strchr(line, ':');
    size_t headerLen = (colon != NULL) ? (size_t)(colon - line) : strlen(line);

    static const char *const tokens[] = { "TCPXX", "NOGATE", "RFONLY" };
    for (size_t t = 0; t < sizeof(tokens) / sizeof(tokens[0]); t++) {
        const char *hit = strstr(line, tokens[t]);
        if (hit != NULL && (size_t)(hit - line) < headerLen)
            return true;
    }
    return false;
}

// Apply the four gating conditions to one message. Returns true to transmit;
// every false return has already counted the reason it refused.
static bool messageGatePass(const char *srcLine, const char *srcCall, const char *info) {
    char addressee[12];
    if (!messageAddressee(info, addressee, sizeof(addressee))) {
        // Not shaped like a message after all: nothing to reason about, so
        // this is left to the type filter and the budlist that already ran.
        return true;
    }

    uint32_t window = g_config.igate_local_window_sec;

    if (headerForbidsRf(srcLine)) {
        ESP_LOGD(TAG, "INET2RF message not gated - header forbids RF: %s", srcLine);
        igate_note_drop(DROP_MSG_NOGATE);
        return false;
    }
    if (!lastheard_heard_rf_within(addressee, window)) {
        ESP_LOGD(TAG, "INET2RF message not gated - %s not heard on RF in the last %u s", addressee, (unsigned)window);
        igate_note_drop(DROP_MSG_NOT_LOCAL);
        return false;
    }
    if (lastheard_heard_inet_within(addressee, window)) {
        ESP_LOGD(TAG, "INET2RF message not gated - %s is Internet-connected", addressee);
        igate_note_drop(DROP_MSG_ADDRESSEE_INET);
        return false;
    }
    if (lastheard_heard_rf_within(srcCall, window)) {
        ESP_LOGD(TAG, "INET2RF message not gated - sender %s was heard on RF: %s", srcCall, srcLine);
        igate_note_drop(DROP_MSG_SENDER_LOCAL);
        return false;
    }

    return true;
}

// ---------------------------------------------------------------------------
// Wrap a plain (non-third-party) APRS-IS line into the third-party frame this
// station transmits on RF for it, per the APRS third-party-traffic spec: our
// own header carries the frame, and the original station's data is preserved
// verbatim behind a '}' as the payload of that header, with its own path
// replaced by "TCPIP,<us>*" so a receiver can tell at a glance that the
// packet arrived over the Internet and was not heard locally. This is what
// keeps qAR/qAO/TCPIP and any other APRS-IS-only path token off the air, and
// is what lets every other IGate that hears the frame recognise it as already
// gated and avoid gating it back - the two together are the loop protection
// third-party wrapping exists to provide.
//
// The original path is discarded in full rather than filtered: only the
// inner source and destination calls (the header up to the first ',') are
// kept, everything from there to the first ':' is dropped, and this
// station's own configured IGate path takes its place. The information
// field after that first ':' is carried through unmodified.
//
// Returns the frame length on success, or 0 (after logging a warning) if
// the input line has no usable "SRC>DST...:" header or the built frame does
// not fit APRS_TNC2_BUF_SIZE - never a truncated frame.
static int build_thirdparty_frame(const char *inetLine, char *out, size_t outMax) {
    const char *gt = strchr(inetLine, '>');
    const char *colon = strchr(inetLine, ':');
    if (!gt || !colon || colon <= gt) {
        ESP_LOGW(TAG, "INET2RF: line has no usable header, not gated: %s", inetLine);
        return 0;
    }

    char innerSrc[12];
    size_t srcLen = (size_t)(gt - inetLine);
    if (srcLen >= sizeof(innerSrc))
        srcLen = sizeof(innerSrc) - 1;
    memcpy(innerSrc, inetLine, srcLen);
    innerSrc[srcLen] = 0;

    const char *dstStart = gt + 1;
    const char *dstEnd = dstStart;
    while (dstEnd < colon && *dstEnd != ',')
        dstEnd++;
    char innerDst[12];
    size_t dstLen = (size_t)(dstEnd - dstStart);
    if (dstLen >= sizeof(innerDst))
        dstLen = sizeof(innerDst) - 1;
    memcpy(innerDst, dstStart, dstLen);
    innerDst[dstLen] = 0;

