hiperiondev/esp32idf_APRS/main/aprs_service.c
    if (innerSrc[0] == 0 || innerDst[0] == 0) {
        ESP_LOGW(TAG, "INET2RF: line has an empty source or destination call, not gated: %s", inetLine);
        return 0;
    }

    const char *info = colon + 1;

    // Snapshot the own-station identity and path selection used to build the
    // frame header, under the same lock a concurrent web save writes them
    // with, so nothing here observes aprs_mycall/aprs_ssid/igate_path
    // mid-update.
    char cfgMycall[10];
    uint8_t cfgSsid;
    uint8_t cfgPathSel;
    app_config_lock();
    memcpy(cfgMycall, g_config.aprs_mycall, sizeof(cfgMycall));
    cfgSsid = g_config.aprs_ssid;
    cfgPathSel = g_config.igate_path;
    app_config_unlock();

    char callField[16];
    if (cfgSsid > 0)
        snprintf(callField, sizeof(callField), "%s-%d", cfgMycall, (int)cfgSsid);
    else
        snprintf(callField, sizeof(callField), "%s", cfgMycall);

    char gatePath[80];
    aprs_path_build_suffix_from_config(cfgPathSel, gatePath, sizeof(gatePath));

    int n = snprintf(out, outMax, "%s>" IGATE_THIRDPARTY_DEST "%s:}%s>%s,TCPIP,%s*:%s", callField, gatePath, innerSrc, innerDst, callField, info);
    if (n < 0)
        return 0;
    if ((size_t)n >= outMax || n > APRS_TNC2_MAX_LEN) {
        ESP_LOGW(TAG, "INET2RF third-party frame too long (%d bytes, max %d), not gated: %s", n, APRS_TNC2_MAX_LEN, inetLine);
        return 0;
    }
    return n;
}

// ---------------------------------------------------------------------------
// INET -> RF: called by igate.c for every non-comment line read from APRS-IS.
// ---------------------------------------------------------------------------
static void inet2rfHandler(const char *line) {
    // Feed the dashboard LAST HEARD table from APRS-IS too, not just RF, so
    // there's something to see while verifying the IGate uplink even before
    // the local radio has decoded anything. TNC2 line looks like
    // "SRC-N>DST,PATH,qAR,SERVER:info" - split at '>' for the callsign and
    // at ':' for the via/path, matching what aprs_msg_callback does for RF.
    char callsign[12] = "";
    char symTable = 0, symCode = 0;
    {
        const char *gt = strchr(line, '>');
        const char *colon = strchr(line, ':');
        if (gt && colon && colon > gt) {
            size_t callLen = (size_t)(gt - line);
            if (callLen >= sizeof(callsign))
                callLen = sizeof(callsign) - 1;
            memcpy(callsign, line, callLen);
            callsign[callLen] = 0;

            char path[48];
            size_t pathLen = (size_t)(colon - gt - 1);
            if (pathLen >= sizeof(path))
                pathLen = sizeof(path) - 1;
            memcpy(path, gt + 1, pathLen);
            path[pathLen] = 0;

            const char *info = colon + 1;
            size_t infoLen = strlen(info);
            aprs_extract_symbol(info, infoLen, &symTable, &symCode);

            // A frame that arrived over APRS-IS was never heard off the air
            // here, so it is never direct.
            lastheard_add(callsign, path, false, false, symTable, symCode);
        }
    }

    // See the identical note at the RF call site above: handleIncomingAPRS()
    // must run for directed queries even when messaging itself is off. Both
    // entry points are told the line came from the APRS-IS feed, which is what
    // lets the query responder keep internet traffic off the transmitter: a
    // general query such as "?APRS?" is ordinary backbone traffic, and the
    // answer to one belongs on the channel the question arrived on.
    if (g_config.msg_enable || (g_config.query_en && g_config.query_directed_en))
        handleIncomingAPRS(line, QUERY_SRC_INET);

    if (g_config.query_en)
        query_process(line, QUERY_SRC_INET);

    if (g_config.inet2rf) {
        // Generic queries ("?APRS?", "?WX?", "?IGATE?", ...) are never gated
        // onto RF: transmitting one over the air would let a single APRS-IS
        // client trigger a query responder reply from every RF station that
        // implements one within earshot. This check is unconditional and
        // independent of g_config.inet2rfFilter, so it cannot be defeated by
        // any checkbox state. A directed query (":CALLSIGN :?APRSD", data
        // type ':') is unaffected: only a payload whose first byte is '?' is
        // dropped here.
        {
            const char *colon = strchr(line, ':');
            if (colon && colon[1] == '?') {
                igate_note_drop(DROP_GENERIC_QUERY);
                return;
            }
        }

        // Never gate our OWN reports from INET back to RF. After we upload a
        // beacon / weather / telemetry / message report to APRS-IS (via its
        // *_2inet flag) the server echoes it right back to us; without this
        // guard the IGATE INET->RF filter below would decide whether our own
        // report is re-transmitted on RF, so turning a type OFF in that filter
        // would silence our own report on the air. Our reports must reach RF
        // ONLY through their own "Send via RF" (*_2rf) flags (weather.c /
        // beacon.c); this filter governs foreign internet traffic exclusively.
        // Re-gating our own echo would also double-transmit it (once directly
        // via *_2rf, once here) and is a classic IGate feedback-loop source.
        if (inet_line_is_own_report(line)) {
            ESP_LOGD(TAG, "INET2RF: own report echoed by APRS-IS, not re-gated (its *_2rf flag governs RF): %s", line);
            return;
        }

        // g_config.inet2rfFilter is a whitelist of payload types (the IGATE
        // Filter fieldset on the /igate page): classify the line and drop it
        // unless its bit is set. Unclassifiable payloads - third-party
        // traffic in particular, which is exactly how an IGate loop starts -
        // classify as 0 and never pass.
        //
        // Dropped lines are logged at debug level only: the RX-IS entry
        // igate.c already added to the traffic ring covers them, and an
        // unfiltered APRS-IS feed would otherwise flush the ring with lines
        // that never went anywhere.
        uint16_t type = aprs_filter_classify_tnc2(line);

